Revit 2024 API
Schema.ListSchemas Method
 Lists all schemas in memory.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static IList<Schema> ListSchemas()
Visual Basic
Public Shared Function ListSchemas As IList(Of Schema)
Visual C++
public:
static IList<Schema^>^ ListSchemas()
See Also
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace